2025.04.29.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-29 Tue 10:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2025.04.22.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2025.05.06.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of April 22 to 29, 2025.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">dream-html, pure-html 3.10.0 and 3.10.1</a></li>
<li><a href="#2">State of OCaml Platform on Windows</a></li>
<li><a href="#3">Upgrading Semgrep from OCaml 4 to OCaml 5 + dynamic_gc utility</a></li>
<li><a href="#4">Typesafe complicated combinations</a></li>
<li><a href="#5">Other OCaml News</a></li>
<li><a href="#orga722fd2">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">dream-html, pure-html 3.10.0 and 3.10.1</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dream-html-pure-html-3-10-0-3-10-1/16537/1">https://discuss.ocaml.org/t/ann-dream-html-pure-html-3-10-0-3-10-1/16537/1</a>
</p>
</div>
<div id="outline-container-org0e37693" class="outline-3">
<h3 id="org0e37693">Yawar Amin announced</h3>
<div class="outline-text-3" id="text-org0e37693">
<p>
Happy to announce a couple of releases of <a href="https://github.com/yawaramin/dream-html">dream-html</a>:
</p>

<p>
3.10.0: add support for <a href="https://yawaramin.github.io/dream-html/pure-html/Pure_html/#rss-and-atom">RSS/Atom</a> markup; add ability to handle <a href="https://yawaramin.github.io/dream-html/dream-html/Dream_html/Form/index.html#val-multiple">multiple</a> nested form values; <a href="https://yawaramin.github.io/dream-html/pure-html/Pure_html/#val-concat">concatenate</a> HTML nodes with a separator node between them; add support for <a href="https://yawaramin.github.io/dream-html/pure-html/Pure_html/HTML/index.html#val-popover">popovers</a> and <a href="https://yawaramin.github.io/dream-html/pure-html/Pure_html/HTML/index.html#val-shadowrootclonable">Declarative Shadow DOM</a> markup.
</p>

<p>
3.10.1: use single quotes for attributes which must contain JSON values, like htmx's <a href="https://yawaramin.github.io/dream-html/pure-html/Pure_html/Hx/index.html#val-vals">hx-vals</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">State of OCaml Platform on Windows</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-state-of-ocaml-platform-on-windows/16540/1">https://discuss.ocaml.org/t/ann-state-of-ocaml-platform-on-windows/16540/1</a>
</p>
</div>
<div id="outline-container-org4ae2342" class="outline-3">
<h3 id="org4ae2342">Leandro Ostera announced</h3>
<div class="outline-text-3" id="text-org4ae2342">
<p>
Hello folks :waving_hand: 
</p>

<p>
We're happy to share the first version of the State of the OCaml Platform on Windows document with you. Please find the document here: <a href="https://docs.google.com/document/d/1-aTygzDsxy4mnqvSKEVhifA1KDRyP-Axdogjgb8i3Gg/edit?usp=sharing">https://docs.google.com/document/d/1-aTygzDsxy4mnqvSKEVhifA1KDRyP-Axdogjgb8i3Gg/edit?usp=sharing</a>.
</p>

<p>
As part of the <a href="https://tarides.com/blog/2024-05-22-launching-the-first-class-windows-project/">First-Class Windows</a> project, we've been assessing the state of OCaml on Windows. This document is a summary of our investigation, including our consultations with individuals involved in Windows-related work.
</p>

<p>
This document started internally at Tarides and quickly included major contributors and users of OCaml on Windows for its drafting and review stages. Thank you to @jbeckford, @klakplok, @Vincent_Balat, @Rucikir, @lambda_foo, @rikusilvola, @kayceesrk, @dra27, @Isabella, @rjbou, @avsm, @kentookura, @oandrieu, @shonfeder, @sabine, and everyone else at Tarides for helping us shape and review this document! :folded_hands: 
</p>

<p>
The immediate call to action for you is to give us your inputs and thoughts, challenge it and help us make it better. You can do this directly on that document, or by quoting into this thread. 
</p>

<p>
We'll have a window of 8 weeks to allow for this to happen. After that we will move this into the OCaml Platform section of OCaml.org to use as a reference and keep it updated over time.
</p>

<p>
Happy coding! :two_hump_camel: 
</p>

<p>
/ @sudha &amp; @leostera 
on behalf of Tarides
</p>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">Upgrading Semgrep from OCaml 4 to OCaml 5 + dynamic_gc utility</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/upgrading-semgrep-from-ocaml-4-to-ocaml-5-dynamic-gc-utility/16256/5">https://discuss.ocaml.org/t/upgrading-semgrep-from-ocaml-4-to-ocaml-5-dynamic-gc-utility/16256/5</a>
</p>
</div>
<div id="outline-container-org265a16a" class="outline-3">
<h3 id="org265a16a">Continuing this thread, Nat Mote announced</h3>
<div class="outline-text-3" id="text-org265a16a">
<p>
I've just released a new version that includes the following module:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">module</span> <span style="color: #444fcf;">Config</span> : <span style="color: #000000; font-weight: bold;">sig</span>
  <span style="color: #4f677f; font-style: italic;">(** Produces a simple config that will set space_overhead to 120, the default,</span>
<span style="color: #4f677f; font-style: italic;">   * when the size of the major heap is below the given threshold. When the heap</span>
<span style="color: #4f677f; font-style: italic;">   * is larger than the given threshold, space_overhead will be set to 80. *)</span>
  <span style="color: #000000; font-weight: bold;">val</span> <span style="color: #a7601f;">simple</span>: <span style="color: #00824f;">threshold_mb</span>:int -&gt; config
<span style="color: #000000; font-weight: bold;">end</span>
</pre>
</div>

<p>
That will make the utility even easier to configure while still allowing the application developer to set a memory threshold that is relevant to them.
</p>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">Typesafe complicated combinations</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/blog-typesafe-complicated-combinations/16548/1">https://discuss.ocaml.org/t/blog-typesafe-complicated-combinations/16548/1</a>
</p>
</div>
<div id="outline-container-orgf847bd8" class="outline-3">
<h3 id="orgf847bd8">rand announced</h3>
<div class="outline-text-3" id="text-orgf847bd8">
<p>
Heya everyone &#x2013;
</p>

<p>
I've <a href="https://r7p5.earth/blog/2025-4-25/Typesafe%20complicated%20combinations">written a blogpost</a> based on a recent experience adding typesafety to the <code>pmmd</code> codebase &#x2013; handling a lot of different data and functions that needs to be combined in the right ways. 
</p>

<p>
In it I make use of phantom types and OCamls module system to express the invariants - which I find is a nice set of typesystem features to express complicated relations in a relatively simple but efficient and scaleable way. Also, I think interesting design patterns can emerge from this way of working.
</p>

<p>
Let me know here if you have any questions or comments 
</p>

<p>
Thanks (:
</p>
</div>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="5">Other OCaml News</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org07afafd" class="outline-3">
<h3 id="org07afafd">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-org07afafd">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://blog.robur.coop/articles/2025-04-23-email-verification.html">SPF, DKIM, DMARC and ARC</a></li>
<li><a href="https://tarides.com/blog/2025-04-23-feature-parity-series-restoring-the-msvc-port">Feature Parity Series: Restoring the MSVC Port</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga722fd2" class="outline-2">
<h2 id="orga722fd2">Old CWN</h2>
<div class="outline-text-2" id="text-orga722fd2">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="orgf478165">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
